; domain
(define (domain robot_chef)
    (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions)

    (:types
        location - object
        item - object
        robot - object
        ingredient tool dish - item
    )

    (:predicates
        (robot-at ?r - robot ?l - location)
        (item-at ?i - item ?l - location)
        (holding ?r - robot ?i - item)
        (hand-free ?r - robot)
        (connected ?l1 ?l2 - location)

        (is-storage ?l - location)
        (is-cooking ?l - location)
        (is-serving ?l - location)
        (is-preparation ?l - location)
        (is-dishwashing ?l - location)
        (is-cutting ?l - location)
        (is-mixing ?l - location)

        (ingredient-need-mixing ?i - ingredient)
        (ingredient-need-cutting ?i - ingredient)
        (ingredient-need-cooking ?i - ingredient)

        (ingredient-mixed ?i - ingredient)
        (ingredient-cut ?i - ingredient)
        (ingredient-cooked ?i - ingredient)

        (tool-clean ?t - tool)
        (is-cutting-tool ?t - tool)
        (is-mixing-tool ?t - tool)

        (ingredient-for ?i - ingredient ?d - dish)
        (dish-ready ?d - dish)
        (dish-served ?d - dish)
    )

    (:action move
        :parameters (?r - robot ?from ?to - location)
        :precondition (and
            (robot-at ?r ?from)
            (connected ?from ?to)
        )
        :effect (and
            (not (robot-at ?r ?from))
            (robot-at ?r ?to)
        )
    )

    (:action pick-up
        :parameters (?r - robot ?i - item ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (item-at ?i ?l)
            (hand-free ?r)
        )
        :effect (and
            (not (item-at ?i ?l))
            (not (hand-free ?r))
            (holding ?r ?i)
        )
    )

    (:action put-down
        :parameters (?r - robot ?i - item ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (holding ?r ?i)
        )
        :effect (and
            (item-at ?i ?l)
            (hand-free ?r)
            (not (holding ?r ?i))
        )
    )

    (:action cut-ingredient
        :parameters (?r - robot ?i - ingredient ?t - tool ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-cutting ?l)
            (holding ?r ?t)
            (is-cutting-tool ?t)
            (tool-clean ?t)
            (item-at ?i ?l)
            (ingredient-need-cutting ?i)
        )
        :effect (and
            (ingredient-cut ?i)
            (not (tool-clean ?t))
        )
    )

    (:action mix-ingredient
        :parameters (?r - robot ?i - ingredient ?t - tool ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-mixing ?l)
            (holding ?r ?t)
            (is-mixing-tool ?t)
            (tool-clean ?t)
            (item-at ?i ?l)
            (ingredient-need-mixing ?i)
        )
        :effect (and
            (ingredient-mixed ?i)
            (not (tool-clean ?t))
        )
    )

    (:action cook-ingredient
        :parameters (?r - robot ?i - ingredient ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-cooking ?l)
            (item-at ?i ?l)
            (ingredient-need-cooking ?i)
        )
        :effect (ingredient-cooked ?i)
    )

    (:action clean-tool
        :parameters (?r - robot ?t - tool ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-dishwashing ?l)
            (holding ?r ?t)
            (not (tool-clean ?t))
        )
        :effect (tool-clean ?t)
    )

    (:action prepare-dish
        :parameters (?r - robot ?d - dish ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-preparation ?l)
            (forall
                (?i - ingredient)
                (imply
                    (ingredient-for ?i ?d)
                    (and
                        (item-at ?i ?l)
                        (or (not (ingredient-need-cutting ?i)) (ingredient-cut ?i))
                        (or (not (ingredient-need-mixing ?i)) (ingredient-mixed ?i))
                        (or (not (ingredient-need-cooking ?i)) (ingredient-cooked ?i))
                    )
                )
            )
        )
        :effect (dish-ready ?d)
    )

    (:action serve-dish
        :parameters (?r - robot ?d - dish ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-serving ?l)
            (dish-ready ?d)
        )
        :effect (dish-served ?d)
    )
)

; problem
(define (problem cook-meals)
    (:domain robot_chef)

    (:objects
        kitchen-storage kitchen-cutting kitchen-mixing kitchen-cooking kitchen-prep kitchen-serving kitchen-washing - location
        chef - robot
        knife spoon - tool
        rice fish vegetables noodles broth - ingredient
        sushi ramen - dish
    )

    (:init
        ; Robot initial location
        (robot-at chef kitchen-cooking)
        (hand-free chef)

        ; Kitchen layout
        (is-storage kitchen-storage)
        (is-cutting kitchen-cutting)
        (is-mixing kitchen-mixing)
        (is-cooking kitchen-cooking)
        (is-preparation kitchen-prep)
        (is-serving kitchen-serving)
        (is-dishwashing kitchen-washing)

        ; Room connections
        (connected kitchen-storage kitchen-mixing)
        (connected kitchen-mixing kitchen-storage)
        (connected kitchen-storage kitchen-cutting)
        (connected kitchen-cutting kitchen-storage)
        (connected kitchen-mixing kitchen-cutting)
        (connected kitchen-cutting kitchen-mixing)
        (connected kitchen-mixing kitchen-prep)
        (connected kitchen-prep kitchen-mixing)
        (connected kitchen-prep kitchen-cooking)
        (connected kitchen-cooking kitchen-prep)
        (connected kitchen-prep kitchen-washing)
        (connected kitchen-washing kitchen-prep)
        (connected kitchen-cooking kitchen-washing)
        (connected kitchen-washing kitchen-cooking)
        (connected kitchen-cooking kitchen-serving)
        (connected kitchen-serving kitchen-cooking)
        (connected kitchen-cutting kitchen-serving)
        (connected kitchen-serving kitchen-cutting)

        ; Initial ingredients location
        (item-at rice kitchen-storage)
        (item-at fish kitchen-storage)
        (item-at vegetables kitchen-storage)
        (item-at noodles kitchen-storage)
        (item-at broth kitchen-storage)

        ; Tools setup
        (item-at knife kitchen-cutting)
        (item-at spoon kitchen-mixing)
        (tool-clean knife)
        (tool-clean spoon)
        (is-cutting-tool knife)
        (is-mixing-tool spoon)

        ; Ingredient requirements
        (ingredient-need-mixing rice)
        (ingredient-need-cooking rice)
        (ingredient-need-cutting fish)
        (ingredient-need-cutting vegetables)
        (ingredient-need-mixing noodles)
        (ingredient-need-cooking noodles)
        (ingredient-need-mixing broth)
        (ingredient-need-cooking broth)

        ; Recipe definitions
        (ingredient-for rice sushi)
        (ingredient-for fish sushi)
        (ingredient-for vegetables sushi)
        (ingredient-for noodles ramen)
        (ingredient-for broth ramen)
        (ingredient-for vegetables ramen)
    )

    (:goal
        (and
            (dish-served sushi)
            (dish-served ramen)
        )
    )
)

; plan
1. (move chef kitchen-cooking kitchen-prep)
   deleted: (robot-at chef kitchen-cooking)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
2. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
3. (move chef kitchen-mixing kitchen-cutting)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-cutting)
   goals met: 0 of 2
4. (pick-up chef knife kitchen-cutting)
   deleted: (item-at knife kitchen-cutting) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
5. (move chef kitchen-cutting kitchen-storage)
   deleted: (robot-at chef kitchen-cutting)
   added: (robot-at chef kitchen-storage)
   goals met: 0 of 2
6. (put-down chef knife kitchen-storage)
   deleted: (holding chef knife)
   added: (item-at knife kitchen-storage) (hand-free chef)
   goals met: 0 of 2
7. (pick-up chef broth kitchen-storage)
   deleted: (item-at broth kitchen-storage) (hand-free chef)
   added: (holding chef broth)
   goals met: 0 of 2
8. (move chef kitchen-storage kitchen-mixing)
   deleted: (robot-at chef kitchen-storage)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
9. (put-down chef broth kitchen-mixing)
   deleted: (holding chef broth)
   added: (item-at broth kitchen-mixing) (hand-free chef)
   goals met: 0 of 2
10. (pick-up chef spoon kitchen-mixing)
   deleted: (item-at spoon kitchen-mixing) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
11. (mix-ingredient chef broth spoon kitchen-mixing)
   deleted: (tool-clean spoon)
   added: (ingredient-mixed broth)
   goals met: 0 of 2
12. (move chef kitchen-mixing kitchen-storage)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-storage)
   goals met: 0 of 2
13. (put-down chef spoon kitchen-storage)
   deleted: (holding chef spoon)
   added: (item-at spoon kitchen-storage) (hand-free chef)
   goals met: 0 of 2
14. (pick-up chef rice kitchen-storage)
   deleted: (item-at rice kitchen-storage) (hand-free chef)
   added: (holding chef rice)
   goals met: 0 of 2
15. (move chef kitchen-storage kitchen-mixing)
   deleted: (robot-at chef kitchen-storage)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
16. (put-down chef rice kitchen-mixing)
   deleted: (holding chef rice)
   added: (item-at rice kitchen-mixing) (hand-free chef)
   goals met: 0 of 2
17. (pick-up chef broth kitchen-mixing)
   deleted: (item-at broth kitchen-mixing) (hand-free chef)
   added: (holding chef broth)
   goals met: 0 of 2
18. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
19. (put-down chef broth kitchen-prep)
   deleted: (holding chef broth)
   added: (item-at broth kitchen-prep) (hand-free chef)
   goals met: 0 of 2
20. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
21. (move chef kitchen-mixing kitchen-storage)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-storage)
   goals met: 0 of 2
22. (pick-up chef noodles kitchen-storage)
   deleted: (item-at noodles kitchen-storage) (hand-free chef)
   added: (holding chef noodles)
   goals met: 0 of 2
23. (move chef kitchen-storage kitchen-mixing)
   deleted: (robot-at chef kitchen-storage)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
24. (put-down chef noodles kitchen-mixing)
   deleted: (holding chef noodles)
   added: (item-at noodles kitchen-mixing) (hand-free chef)
   goals met: 0 of 2
25. (move chef kitchen-mixing kitchen-storage)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-storage)
   goals met: 0 of 2
26. (pick-up chef spoon kitchen-storage)
   deleted: (item-at spoon kitchen-storage) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
27. (move chef kitchen-storage kitchen-mixing)
   deleted: (robot-at chef kitchen-storage)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
28. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
29. (move chef kitchen-prep kitchen-washing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-washing)
   goals met: 0 of 2
30. (clean-tool chef spoon kitchen-washing)
   added: (tool-clean spoon)
   goals met: 0 of 2
31. (put-down chef spoon kitchen-washing)
   deleted: (holding chef spoon)
   added: (item-at spoon kitchen-washing) (hand-free chef)
   goals met: 0 of 2
32. (move chef kitchen-washing kitchen-prep)
   deleted: (robot-at chef kitchen-washing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
33. (pick-up chef broth kitchen-prep)
   deleted: (item-at broth kitchen-prep) (hand-free chef)
   added: (holding chef broth)
   goals met: 0 of 2
34. (move chef kitchen-prep kitchen-cooking)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-cooking)
   goals met: 0 of 2
35. (put-down chef broth kitchen-cooking)
   deleted: (holding chef broth)
   added: (item-at broth kitchen-cooking) (hand-free chef)
   goals met: 0 of 2
36. (cook-ingredient chef broth kitchen-cooking)
   added: (ingredient-cooked broth)
   goals met: 0 of 2
37. (pick-up chef broth kitchen-cooking)
   deleted: (item-at broth kitchen-cooking) (hand-free chef)
   added: (holding chef broth)
   goals met: 0 of 2
38. (move chef kitchen-cooking kitchen-prep)
   deleted: (robot-at chef kitchen-cooking)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
39. (put-down chef broth kitchen-prep)
   deleted: (holding chef broth)
   added: (item-at broth kitchen-prep) (hand-free chef)
   goals met: 0 of 2
40. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
41. (move chef kitchen-mixing kitchen-storage)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-storage)
   goals met: 0 of 2
42. (pick-up chef vegetables kitchen-storage)
   deleted: (item-at vegetables kitchen-storage) (hand-free chef)
   added: (holding chef vegetables)
   goals met: 0 of 2
43. (move chef kitchen-storage kitchen-mixing)
   deleted: (robot-at chef kitchen-storage)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
44. (put-down chef vegetables kitchen-mixing)
   deleted: (holding chef vegetables)
   added: (item-at vegetables kitchen-mixing) (hand-free chef)
   goals met: 0 of 2
45. (pick-up chef noodles kitchen-mixing)
   deleted: (item-at noodles kitchen-mixing) (hand-free chef)
   added: (holding chef noodles)
   goals met: 0 of 2
46. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
47. (move chef kitchen-prep kitchen-cooking)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-cooking)
   goals met: 0 of 2
48. (put-down chef noodles kitchen-cooking)
   deleted: (holding chef noodles)
   added: (item-at noodles kitchen-cooking) (hand-free chef)
   goals met: 0 of 2
49. (cook-ingredient chef noodles kitchen-cooking)
   added: (ingredient-cooked noodles)
   goals met: 0 of 2
50. (pick-up chef noodles kitchen-cooking)
   deleted: (item-at noodles kitchen-cooking) (hand-free chef)
   added: (holding chef noodles)
   goals met: 0 of 2
51. (move chef kitchen-cooking kitchen-prep)
   deleted: (robot-at chef kitchen-cooking)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
52. (put-down chef noodles kitchen-prep)
   deleted: (holding chef noodles)
   added: (item-at noodles kitchen-prep) (hand-free chef)
   goals met: 0 of 2
53. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
54. (pick-up chef vegetables kitchen-mixing)
   deleted: (item-at vegetables kitchen-mixing) (hand-free chef)
   added: (holding chef vegetables)
   goals met: 0 of 2
55. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
56. (put-down chef vegetables kitchen-prep)
   deleted: (holding chef vegetables)
   added: (item-at vegetables kitchen-prep) (hand-free chef)
   goals met: 0 of 2
57. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
58. (move chef kitchen-mixing kitchen-storage)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-storage)
   goals met: 0 of 2
59. (pick-up chef knife kitchen-storage)
   deleted: (item-at knife kitchen-storage) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
60. (move chef kitchen-storage kitchen-mixing)
   deleted: (robot-at chef kitchen-storage)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
61. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
62. (move chef kitchen-prep kitchen-washing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-washing)
   goals met: 0 of 2
63. (put-down chef knife kitchen-washing)
   deleted: (holding chef knife)
   added: (item-at knife kitchen-washing) (hand-free chef)
   goals met: 0 of 2
64. (pick-up chef spoon kitchen-washing)
   deleted: (item-at spoon kitchen-washing) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
65. (move chef kitchen-washing kitchen-prep)
   deleted: (robot-at chef kitchen-washing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
66. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
67. (mix-ingredient chef rice spoon kitchen-mixing)
   deleted: (tool-clean spoon)
   added: (ingredient-mixed rice)
   goals met: 0 of 2
68. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
69. (move chef kitchen-prep kitchen-washing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-washing)
   goals met: 0 of 2
70. (clean-tool chef spoon kitchen-washing)
   added: (tool-clean spoon)
   goals met: 0 of 2
71. (put-down chef spoon kitchen-washing)
   deleted: (holding chef spoon)
   added: (item-at spoon kitchen-washing) (hand-free chef)
   goals met: 0 of 2
72. (pick-up chef knife kitchen-washing)
   deleted: (item-at knife kitchen-washing) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
73. (move chef kitchen-washing kitchen-prep)
   deleted: (robot-at chef kitchen-washing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
74. (put-down chef knife kitchen-prep)
   deleted: (holding chef knife)
   added: (item-at knife kitchen-prep) (hand-free chef)
   goals met: 0 of 2
75. (pick-up chef noodles kitchen-prep)
   deleted: (item-at noodles kitchen-prep) (hand-free chef)
   added: (holding chef noodles)
   goals met: 0 of 2
76. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
77. (put-down chef noodles kitchen-mixing)
   deleted: (holding chef noodles)
   added: (item-at noodles kitchen-mixing) (hand-free chef)
   goals met: 0 of 2
78. (pick-up chef rice kitchen-mixing)
   deleted: (item-at rice kitchen-mixing) (hand-free chef)
   added: (holding chef rice)
   goals met: 0 of 2
79. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
80. (put-down chef rice kitchen-prep)
   deleted: (holding chef rice)
   added: (item-at rice kitchen-prep) (hand-free chef)
   goals met: 0 of 2
81. (pick-up chef knife kitchen-prep)
   deleted: (item-at knife kitchen-prep) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
82. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
83. (move chef kitchen-mixing kitchen-storage)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-storage)
   goals met: 0 of 2
84. (put-down chef knife kitchen-storage)
   deleted: (holding chef knife)
   added: (item-at knife kitchen-storage) (hand-free chef)
   goals met: 0 of 2
85. (pick-up chef fish kitchen-storage)
   deleted: (item-at fish kitchen-storage) (hand-free chef)
   added: (holding chef fish)
   goals met: 0 of 2
86. (move chef kitchen-storage kitchen-mixing)
   deleted: (robot-at chef kitchen-storage)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
87. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
88. (put-down chef fish kitchen-prep)
   deleted: (holding chef fish)
   added: (item-at fish kitchen-prep) (hand-free chef)
   goals met: 0 of 2
89. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
90. (move chef kitchen-mixing kitchen-storage)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-storage)
   goals met: 0 of 2
91. (pick-up chef knife kitchen-storage)
   deleted: (item-at knife kitchen-storage) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
92. (move chef kitchen-storage kitchen-mixing)
   deleted: (robot-at chef kitchen-storage)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
93. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
94. (move chef kitchen-prep kitchen-washing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-washing)
   goals met: 0 of 2
95. (put-down chef knife kitchen-washing)
   deleted: (holding chef knife)
   added: (item-at knife kitchen-washing) (hand-free chef)
   goals met: 0 of 2
96. (pick-up chef spoon kitchen-washing)
   deleted: (item-at spoon kitchen-washing) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
97. (move chef kitchen-washing kitchen-prep)
   deleted: (robot-at chef kitchen-washing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
98. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
99. (mix-ingredient chef noodles spoon kitchen-mixing)
   deleted: (tool-clean spoon)
   added: (ingredient-mixed noodles)
   goals met: 0 of 2
100. (put-down chef spoon kitchen-mixing)
   deleted: (holding chef spoon)
   added: (item-at spoon kitchen-mixing) (hand-free chef)
   goals met: 0 of 2
101. (pick-up chef noodles kitchen-mixing)
   deleted: (item-at noodles kitchen-mixing) (hand-free chef)
   added: (holding chef noodles)
   goals met: 0 of 2
102. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
103. (put-down chef noodles kitchen-prep)
   deleted: (holding chef noodles)
   added: (item-at noodles kitchen-prep) (hand-free chef)
   goals met: 0 of 2
104. (pick-up chef rice kitchen-prep)
   deleted: (item-at rice kitchen-prep) (hand-free chef)
   added: (holding chef rice)
   goals met: 0 of 2
105. (move chef kitchen-prep kitchen-cooking)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-cooking)
   goals met: 0 of 2
106. (put-down chef rice kitchen-cooking)
   deleted: (holding chef rice)
   added: (item-at rice kitchen-cooking) (hand-free chef)
   goals met: 0 of 2
107. (cook-ingredient chef rice kitchen-cooking)
   added: (ingredient-cooked rice)
   goals met: 0 of 2
108. (pick-up chef rice kitchen-cooking)
   deleted: (item-at rice kitchen-cooking) (hand-free chef)
   added: (holding chef rice)
   goals met: 0 of 2
109. (move chef kitchen-cooking kitchen-prep)
   deleted: (robot-at chef kitchen-cooking)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
110. (put-down chef rice kitchen-prep)
   deleted: (holding chef rice)
   added: (item-at rice kitchen-prep) (hand-free chef)
   goals met: 0 of 2
111. (move chef kitchen-prep kitchen-washing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-washing)
   goals met: 0 of 2
112. (pick-up chef knife kitchen-washing)
   deleted: (item-at knife kitchen-washing) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
113. (move chef kitchen-washing kitchen-prep)
   deleted: (robot-at chef kitchen-washing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
114. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
115. (put-down chef knife kitchen-mixing)
   deleted: (holding chef knife)
   added: (item-at knife kitchen-mixing) (hand-free chef)
   goals met: 0 of 2
116. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
117. (pick-up chef vegetables kitchen-prep)
   deleted: (item-at vegetables kitchen-prep) (hand-free chef)
   added: (holding chef vegetables)
   goals met: 0 of 2
118. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
119. (move chef kitchen-mixing kitchen-cutting)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-cutting)
   goals met: 0 of 2
120. (put-down chef vegetables kitchen-cutting)
   deleted: (holding chef vegetables)
   added: (item-at vegetables kitchen-cutting) (hand-free chef)
   goals met: 0 of 2
121. (move chef kitchen-cutting kitchen-mixing)
   deleted: (robot-at chef kitchen-cutting)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
122. (pick-up chef knife kitchen-mixing)
   deleted: (item-at knife kitchen-mixing) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
123. (move chef kitchen-mixing kitchen-cutting)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-cutting)
   goals met: 0 of 2
124. (cut-ingredient chef vegetables knife kitchen-cutting)
   deleted: (tool-clean knife)
   added: (ingredient-cut vegetables)
   goals met: 0 of 2
125. (put-down chef knife kitchen-cutting)
   deleted: (holding chef knife)
   added: (item-at knife kitchen-cutting) (hand-free chef)
   goals met: 0 of 2
126. (pick-up chef vegetables kitchen-cutting)
   deleted: (item-at vegetables kitchen-cutting) (hand-free chef)
   added: (holding chef vegetables)
   goals met: 0 of 2
127. (move chef kitchen-cutting kitchen-mixing)
   deleted: (robot-at chef kitchen-cutting)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
128. (move chef kitchen-mixing kitchen-prep)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-prep)
   goals met: 0 of 2
129. (put-down chef vegetables kitchen-prep)
   deleted: (holding chef vegetables)
   added: (item-at vegetables kitchen-prep) (hand-free chef)
   goals met: 0 of 2
130. (prepare-dish chef ramen kitchen-prep)
   added: (dish-ready ramen)
   goals met: 0 of 2
131. (pick-up chef fish kitchen-prep)
   deleted: (item-at fish kitchen-prep) (hand-free chef)
   added: (holding chef fish)
   goals met: 0 of 2
132. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 0 of 2
133. (move chef kitchen-mixing kitchen-cutting)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-cutting)
   goals met: 0 of 2
134. (put-down chef fish kitchen-cutting)
   deleted: (holding chef fish)
   added: (item-at fish kitchen-cutting) (hand-free chef)
   goals met: 0 of 2
135. (pick-up chef knife kitchen-cutting)
   deleted: (item-at knife kitchen-cutting) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
136. (move chef kitchen-cutting kitchen-serving)
   deleted: (robot-at chef kitchen-cutting)
   added: (robot-at chef kitchen-serving)
   goals met: 0 of 2
137. (serve-dish chef ramen kitchen-serving)
   added: (dish-served ramen)
   goals met: 1 of 2
138. (move chef kitchen-serving kitchen-cooking)
   deleted: (robot-at chef kitchen-serving)
   added: (robot-at chef kitchen-cooking)
   goals met: 1 of 2
139. (move chef kitchen-cooking kitchen-washing)
   deleted: (robot-at chef kitchen-cooking)
   added: (robot-at chef kitchen-washing)
   goals met: 1 of 2
140. (clean-tool chef knife kitchen-washing)
   added: (tool-clean knife)
   goals met: 1 of 2
141. (move chef kitchen-washing kitchen-prep)
   deleted: (robot-at chef kitchen-washing)
   added: (robot-at chef kitchen-prep)
   goals met: 1 of 2
142. (move chef kitchen-prep kitchen-mixing)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-mixing)
   goals met: 1 of 2
143. (move chef kitchen-mixing kitchen-cutting)
   deleted: (robot-at chef kitchen-mixing)
   added: (robot-at chef kitchen-cutting)
   goals met: 1 of 2
144. (cut-ingredient chef fish knife kitchen-cutting)
   deleted: (tool-clean knife)
   added: (ingredient-cut fish)
   goals met: 1 of 2
145. (put-down chef knife kitchen-cutting)
   deleted: (holding chef knife)
   added: (item-at knife kitchen-cutting) (hand-free chef)
   goals met: 1 of 2
146. (pick-up chef fish kitchen-cutting)
   deleted: (item-at fish kitchen-cutting) (hand-free chef)
   added: (holding chef fish)
   goals met: 1 of 2
147. (move chef kitchen-cutting kitchen-serving)
   deleted: (robot-at chef kitchen-cutting)
   added: (robot-at chef kitchen-serving)
   goals met: 1 of 2
148. (move chef kitchen-serving kitchen-cooking)
   deleted: (robot-at chef kitchen-serving)
   added: (robot-at chef kitchen-cooking)
   goals met: 1 of 2
149. (move chef kitchen-cooking kitchen-prep)
   deleted: (robot-at chef kitchen-cooking)
   added: (robot-at chef kitchen-prep)
   goals met: 1 of 2
150. (put-down chef fish kitchen-prep)
   deleted: (holding chef fish)
   added: (item-at fish kitchen-prep) (hand-free chef)
   goals met: 1 of 2
151. (prepare-dish chef sushi kitchen-prep)
   added: (dish-ready sushi)
   goals met: 1 of 2
152. (move chef kitchen-prep kitchen-cooking)
   deleted: (robot-at chef kitchen-prep)
   added: (robot-at chef kitchen-cooking)
   goals met: 1 of 2
153. (move chef kitchen-cooking kitchen-serving)
   deleted: (robot-at chef kitchen-cooking)
   added: (robot-at chef kitchen-serving)
   goals met: 1 of 2
154. (serve-dish chef sushi kitchen-serving)
   added: (dish-served sushi)
   goals met: 2 of 2
